RT-Thread/realboard-lpc4088/Software/lpcware_lpc408x/Examples/EMAC/Emac_EasyWeb/tcpip.c
/******************************************************************
 *****                                                        *****
 *****  Name: tcpip.c                                         *****
 *****  Ver.: 1.0                                             *****
 *****  Date: 07/05/2001                                      *****
 *****  Auth: Andreas Dannenberg                              *****
 *****        HTWK Leipzig                                    *****
 *****        university of applied sciences                  *****
 *****        Germany                                         *****
 *****  Func: implements the TCP/IP-stack and provides a      *****
 *****        simple API to the user                          *****
 *****                                                        *****
 ******************************************************************/

#include "tcpip.h"
#include "EMAC.h"         // Keil: Line added
#include <string.h>       // Keil: Line added
#include "LPC407x_8x_177x_8x.h"      // Keil: Register definition file for LPC2378
#include "lpc_clkpwr.h"
#include "lpc_pinsel.h"
#include "lpc_timer.h"
#include "lpc_nvic.h"
#include "lpc_emac.h"


#if defined ( __CC_ARM   )
uint16_t __align(4) _TxFrame1[(ETH_HEADER_SIZE + IP_HEADER_SIZE + TCP_HEADER_SIZE + MAX_TCP_TX_DATA_SIZE)/2];
uint16_t __align(4) _TxFrame2[(ETH_HEADER_SIZE + MAX_ETH_TX_DATA_SIZE)/2];
uint16_t __align(4) _RxTCPBuffer[MAX_TCP_RX_DATA_SIZE/2]; // space for incoming TCP-data
#elif defined ( __ICCARM__ )
#pragma data_alignment=4
uint16_t _TxFrame1[(ETH_HEADER_SIZE + IP_HEADER_SIZE + TCP_HEADER_SIZE + MAX_TCP_TX_DATA_SIZE)/2];
#pragma data_alignment=4
uint16_t _TxFrame2[(ETH_HEADER_SIZE + MAX_ETH_TX_DATA_SIZE)/2];
#pragma data_alignment=4
uint16_t _RxTCPBuffer[MAX_TCP_RX_DATA_SIZE/2]; // space for incoming TCP-data
#else
uint16_t __attribute__ ((aligned (4))) _TxFrame1[(ETH_HEADER_SIZE + IP_HEADER_SIZE + TCP_HEADER_SIZE + MAX_TCP_TX_DATA_SIZE)/2];
uint16_t __attribute__ ((aligned (4))) _TxFrame2[(ETH_HEADER_SIZE + MAX_ETH_TX_DATA_SIZE)/2];
uint16_t __attribute__ ((aligned (4))) _RxTCPBuffer[MAX_TCP_RX_DATA_SIZE/2]; // space for incoming TCP-data
#endif

uint16_t TxFrame1Size;              // bytes to send in TxFrame1
uint8_t TxFrame2Size;               // bytes to send in TxFrame2
uint8_t TransmitControl;
uint8_t TCPFlags;
uint16_t TCPRemotePort;

uint16_t RemoteMAC[3];              // MAC and IP of current TCP-session
uint16_t RemoteIP[2];


// constants
const uint16_t MyIP[] =                    // "MYIP1.MYIP2.MYIP3.MYIP4"
{
  MYIP_1 + (MYIP_2 << 8),                        // use 'unsigned int' to
  MYIP_3 + (MYIP_4 << 8)                         // achieve word alignment
};

const uint16_t SubnetMask[] =              // "SUBMASK1.SUBMASK2.SUBMASK3.SUBMASK4"
{
  SUBMASK_1 + (SUBMASK_2 << 8),                  // use 'unsigned int' to
  SUBMASK_3 + (SUBMASK_4 << 8)                   // achieve word alignment
};

const uint16_t GatewayIP[] =               // "GWIP1.GWIP2.GWIP3.GWIP4"
{
  GWIP_1 + (GWIP_2 << 8),                        // use 'unsigned int' to
  GWIP_3 + (GWIP_4 << 8)                         // achieve word alignment
};
const uint8_t MyMAC[6] =   // "M1-M2-M3-M4-M5-M6"
{
  MYMAC_1, MYMAC_2, MYMAC_3,
  MYMAC_4, MYMAC_5, MYMAC_6
};


// easyWEB's internal variables
TTCPStateMachine TCPStateMachine;         // perhaps the most important var at all ;-)
TLastFrameSent LastFrameSent;             // retransmission type

uint16_t ISNGenHigh;                // upper word of our Initial Sequence Number
unsigned long TCPSeqNr;                   // next sequence number to send
unsigned long TCPUNASeqNr;                // last unaknowledged sequence number
                                                 // incremented AFTER sending data
unsigned long TCPAckNr;                   // next seq to receive and ack to send
                                                 // incremented AFTER receiving data
uint8_t TCPTimer;                   // inc'd each 262ms
uint8_t RetryCounter;               // nr. of retransmissions

// properties of the just received frame
uint16_t RecdFrameLength;           // EMAC reported frame length
uint16_t RecdFrameMAC[3];           // 48 bit MAC
uint16_t RecdFrameIP[2];            // 32 bit IP
uint16_t RecdIPFrameLength;         // 16 bit IP packet length


#define TxFrame1      ((uint8_t *)_TxFrame1)
#define TxFrame2      ((uint8_t *)_TxFrame2)
#define RxTCPBuffer   ((uint8_t *)_RxTCPBuffer)


// easyWEB-API function
// initalizes the LAN-controller, reset flags, starts timer-ISR
/*********************************************************************//**
 * @brief       
 * @param[in]   
 * @return      
 **********************************************************************/
void TCPLowLevelInit(void)
{
    Init_EMAC();

    TransmitControl = 0;
    TCPFlags = 0;
    TCPStateMachine = CLOSED;
    SocketStatus = 0;
}

// easyWEB-API function
// does a passive open (listen on 'MyIP:TCPLocalPort' for an incoming
// connection)
/*********************************************************************//**
 * @brief       
 * @param[in]   
 * @return      
 **********************************************************************/
void TCPPassiveOpen(void)
{
  if (TCPStateMachine == CLOSED)
  {
    TCPFlags &= ~TCP_ACTIVE_OPEN;                // let's do a passive open!
    TCPStateMachine = LISTENING;
    SocketStatus = SOCK_ACTIVE;                  // reset, socket now active
  }
}

// easyWEB-API function
// does an active open (tries to establish a connection between
// 'MyIP:TCPLocalPort' and 'RemoteIP:TCPRemotePort')
/*********************************************************************//**
 * @brief       
 * @param[in]   
 * @return      
 **********************************************************************/
void TCPActiveOpen(void)
{
  if ((TCPStateMachine == CLOSED) || (TCPStateMachine == LISTENING))
  {
    TCPFlags |= TCP_ACTIVE_OPEN;                 // let's do an active open!
    TCPFlags &= ~IP_ADDR_RESOLVED;               // we haven't opponents MAC yet

