RT-Thread/realboard-lpc4088/Software/lpcware_lpc408x/Examples/EMAC/Emac_EasyWeb/tcpip.c
                        LastFrameSent = TCP_FIN_FRAME;

                        TCPStartRetryTimer();

                        TCPStateMachine = FIN_WAIT_1;
                    }
                }
            }
            
            break;
        }
        case CLOSE_WAIT :
        {
            if (!(TransmitControl & (SEND_FRAME2 | SEND_FRAME1)))     // buffers free?
            {
                if (TCPSeqNr == TCPUNASeqNr)                            // all data ACKed?
                {
                    TCPUNASeqNr++;                                        // count FIN as a byte

                    PrepareTCP_FRAME(TCP_CODE_FIN | TCP_CODE_ACK);        // we NEED a retry-timeout

                    LastFrameSent = TCP_FIN_FRAME;                        // time to say goodbye...

                    TCPStartRetryTimer();

                    TCPStateMachine = LAST_ACK;
                }
            }
            
            break;
        }
        
        default:
            break;
    }

    if (TransmitControl & SEND_FRAME2)
    {
        if (Rdy4Tx())                                // NOTE: when using a very fast MCU, maybe
            SendFrame2();                              // the EMAC isn't ready yet, include
        else 
        {                                       // a kind of timer or counter here
            TCPStateMachine = CLOSED;
            SocketStatus = SOCK_ERR_ETHERNET;          // indicate an error to user
            TCPFlags = 0;                              // clear all flags, stop timers etc.
        }

        TransmitControl &= ~SEND_FRAME2;             // clear tx-flag
    }

    if (TransmitControl & SEND_FRAME1)
    {
        PrepareTCP_DATA_FRAME();                     // build frame w/ actual SEQ, ACK....

        if (Rdy4Tx())                                // EMAC ready to accept our frame?
            SendFrame1();                              // (see note above)
        else 
        {
            TCPStateMachine = CLOSED;
            SocketStatus = SOCK_ERR_ETHERNET;          // indicate an error to user
            TCPFlags = 0;                              // clear all flags, stop timers etc.
        }

        TransmitControl &= ~SEND_FRAME1;             // clear tx-flag
    }
}

// easyWEB internal function
// handles an incoming broadcast frame
/*********************************************************************//**
 * @brief       
 * @param[in]   
 * @return      
 **********************************************************************/
void ProcessEthBroadcastFrame(void)
{
  uint16_t TargetIP[2];

  if (ReadHalfWordBE_EMAC() == FRAME_ARP)           // get frame type, check for ARP
    if (ReadHalfWordBE_EMAC() == HARDW_ETH10)       // Ethernet frame
      if (ReadHalfWordBE_EMAC() == FRAME_IP)        // check protocol
        if (ReadHalfWordBE_EMAC() == IP_HLEN_PLEN)  // check HLEN, PLEN
          if (ReadHalfWordBE_EMAC() == OP_ARP_REQUEST)
          {
            DummyReadFrame_EMAC(6);              // ignore sender's hardware address
            ReadFrame_EMAC(&RecdFrameIP, 4); // read sender's protocol address
            DummyReadFrame_EMAC(6);              // ignore target's hardware address
            ReadFrame_EMAC(&TargetIP, 4);    // read target's protocol address
            if (!memcmp(&MyIP, &TargetIP, 4))    // is it for us?
              PrepareARP_ANSWER();               // yes->create ARP_ANSWER frame
          }
}

// easyWEB internal function
// handles an incoming frame that passed EMAC's address filter
// (individual addressed = IA)
/*********************************************************************//**
 * @brief       
 * @param[in]   
 * @return      
 **********************************************************************/
void ProcessEthIAFrame(void)
{
  uint16_t TargetIP[2];
  uint8_t ProtocolType;

  switch (ReadHalfWordBE_EMAC())                     // get frame type
  {
    case FRAME_ARP :                             // check for ARP
    {
      if ((TCPFlags & (TCP_ACTIVE_OPEN | IP_ADDR_RESOLVED)) == TCP_ACTIVE_OPEN)
        if (ReadHalfWordBE_EMAC() == HARDW_ETH10)         // check for the right prot. etc.
          if (ReadHalfWordBE_EMAC() == FRAME_IP)
            if (ReadHalfWordBE_EMAC() == IP_HLEN_PLEN)
              if (ReadHalfWordBE_EMAC() == OP_ARP_ANSWER)
              {
                TCPStopTimer();                       // OK, now we've the MAC we wanted ;-)
                ReadFrame_EMAC(&RemoteMAC, 6);    // extract opponents MAC
                TCPFlags |= IP_ADDR_RESOLVED;
              }
      break;
    }
    case FRAME_IP :                                        // check for IP-type
    {
      if ((ReadHalfWordBE_EMAC() & 0xFF00 ) == IP_VER_IHL)     // IPv4, IHL=5 (20 Bytes Header)
      {                                                    // ignore Type Of Service
        RecdIPFrameLength = ReadHalfWordBE_EMAC();             // get IP frame's length
        ReadHalfWordBE_EMAC();                                 // ignore identification

        if (!(ReadHalfWordBE_EMAC() & (IP_FLAG_MOREFRAG | IP_FRAGOFS_MASK)))  // only unfragm. frames
        {
          ProtocolType = ReadHalfWordBE_EMAC() & 0xFF;         // get protocol, ignore TTL
          ReadHalfWordBE_EMAC();                               // ignore checksum
          ReadFrame_EMAC(&RecdFrameIP, 4);              // get source IP
          ReadFrame_EMAC(&TargetIP, 4);                 // get destination IP

          if (!memcmp(&MyIP, &TargetIP, 4))                // is it for us?
            switch (ProtocolType) {
              case PROT_ICMP : { ProcessICMPFrame(); break; }
              case PROT_TCP  : { ProcessTCPFrame(); break; }
              case PROT_UDP  : break;                      // not implemented!
            }
        }
      }
      break;
    }
  }
}

// easyWEB internal function
// we've just rec'd an ICMP-frame (Internet Control Message Protocol)
// check what to do and branch to the appropriate sub-function
/*********************************************************************//**
 * @brief       
 * @param[in]   
 * @return      
 **********************************************************************/
void ProcessICMPFrame(void)
{
  uint16_t ICMPTypeAndCode;

  ICMPTypeAndCode = ReadHalfWordBE_EMAC();           // get Message Type and Code
  ReadHalfWordBE_EMAC();                             // ignore ICMP checksum

  switch (ICMPTypeAndCode >> 8) {                // check type
    case ICMP_ECHO :                             // is echo request?
    {
      PrepareICMP_ECHO_REPLY();                  // echo as much as we can...
      break;
    }
  }
}

